Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: For simple formatting transformations, use awk
ru: Для простых преобразований формата используйте awk

source: For simple text transformations (like find/replace), use sed.
ru: Для простых текстовых преобразований (например, найти/заменить), используйте sed.

source: For the control of DESs, presented in the form of an automaton, the method of supervisory control (P.J.
ru: Для управления ДСС, представленной в виде автомата, широко применяется метод супервизорного управления (P.J.

source: For the realization of the integration, formal models of the SOP are constructed, automatically processed (transformed) into source code of new components.
ru: Для реализации интеграции конструируются формальные модели СОП, которые автоматически обрабатываются (преобразуются) в исходный код новых компонентов.

source: For the rest of this section, you can assume that I have replaced the contents of a file called shell-scripting-basics.sh every time I run a script unless otherwise noted.
ru: Далее в этом разделе будем полагать, все изменения вносятся каждый раз в файл shell-scripting-basics.sh, и именно он запускается, если не указано иное.

source: For the system with the bounded change of the parameters, the performance of predictive control is further improved by combining the multi-step control method.
ru: ---Для системы с ограниченным изменением параметров, качество предиктивного управления дополнительно улучшается при помощи добавления многошагового методя управления.

source: For the typical concrete manufacturing process with multivariate, strong coupling, large time delay and multi-time scale, a set of systematic and practical optimization and control scheme is proposed by the two-layer way, in which the upper layer adopts the set-point optimization method with the slow sampling time and the down layer adopts the distributed predictive control with the fast sampling time.
ru: Для типичных производственных процессов с многовариантным прочным сопряжением, большими задержками и мульти-временными шкалами предложены наборы систематических и практических схем оптимизации и управления, при этом используются два слоя, в котором вержний уровень адаптирует методы оптимизации отностиельно уставки (set-point optimization) с медленным временем квантования (sampling time), а нижный уровень адаптирует распределенное предикивное управление с быстрым временем квантования.

source: For these examples, I will be using a sample file of Apple Inc.
ru: В качестве обрабатываемого текта использован образец файла от Apple Inc.,

source: For this to work, you need to put it in the ~/.ssh folder, but you can give it any custom name.
ru: Правильное местоположение - какталог ~/.ssh, но можно задать ему любое имя.

source: Foreground vs. Background Processes
ru: Процессы переднего плана и фоновые процессы

source: Formalization and implementation of a library of constraints.
ru: Формализация и реализация библиотеки ограничений.

source: Formalization of rules for defining perturbations.
ru: Формализация правил для задания алгоритмов породения возмущений.

source: From here you will only get information about the “interactive” mode, but generally, this is all you will ever need.
ru: На этом экране находится только информация об «интерактивном» режиме, показанный текст - это все, что вам когда-либо понадобится.

source: From local computer to remote machine
ru: С локального компьютера на удаленный

source: From other hand side, we can account the amount of the additional resources spent to neutralize uncertainty events and prefer that spending less resources.
ru: С другой стороны, можно оценить объем дополнительных ресурсов, уже израсходованых для нейтрализации неопределенностей, и предпочить сценарии, тратящие меньше ресурсов.

source: From remote machine to local computer
ru: С удаленного компьютера на локальный

source: Functions
ru: Функции

source: Furthermore, it enables you to cull those sequences not meeting the criteria from a names, group, contigsreport, alignreport and summary file.
ru: Кроме того, она позволяет отбраковать те последовательности, которые не отвечают критериям из файлов ```name```, ```group```, ```contigsreport```, ```alignreport``` и ```summary```.

source: Furthermore, you can use the exec command to take the find command to a new level.
ru: Кроме того, используя команду exec, find переходит на новый уровень.

source: General plan of the research by year
ru: Общий план исследований по годам

source: Generally, you would use this program to check just a few things:
ru: Она решает всего нескольких задач:

source: Gives a breakout of the different types of tasks running on your computer.
ru: Показывает различные типы задач, выполняемые на компьютере.

source: Google Chrome is now started again and in the background.
ru: Google Chrome теперь перезапущен и работает в фоновом режиме.

source: Grep is a tool that will find certain patterns or words in one or more files.
ru: Grep - это инструмент, который ищет шаблоны или слова в одном или нескольких файлах.

source: Here You are some examples.
ru: Вот несколько примеров.

source: Here are a few rapid-fire find commands to get you started.
ru: Вот несколько полезных и часто используемых команд:

source: Here are few quick rules of thumb:
ru: Вот несколько простых правил:

source: Here are the most common commands.
ru: Вот самые распространенные команды.

source: Here are three different ways to use the same regular expression:
ru: Вот три разных способа использования одного и того же регулярного выражения:

source: Here is a nice picture of a Husky - https://cdn.orvis.com/images/DBS_SibHusky.jpg
ru: Вот няшная картинка хаски - https://cdn.orvis.com/images/DBS_SibHusky.jpg

source: Here is a simple find command that will find all the jpg files in our home directory.
ru: Пусть есть простая команда на основе find, которая ищет все файлы .jpg домашнем каталоге.

source: Here is a visual to better explain:
ru: Вот иллюстрация, поясняющая вышесказанное:

source: Here is an example of how it works.
ru: Вот пример того, как она работает.

source: Here is an example path.
ru: Вот пример установки переменной PATH.

source: Here is how we would modify the regular expressions to match only the valid email addresses.
ru: Изменим еще раз регулярные выражения, чтобы они соответствовали только действительным адресам электронной почты.

source: Here is my GET request.
ru: Вот этот GET-запрос.

source: Here is the data:
ru: Исходные данные:

source: Hexo 3.9.0
ru: Hexo 3.9.

source: Home
ru: Домашняя страница

source: How did I know this?
ru: Откуда можyj узнать, как управлять программной top?

source: How is a process created?
ru: Как создается процесс?

source: How to download files from the internet
ru: Как скачивать файлы из интернета

source: How to manage processes and monitor system resources with top command
ru: Как управлять процессами и контролировать системные ресурсы с помощью команды top

source: How to manage processes with kill, bg, and fg commands
ru: Как управлять процессами с помощью команд kill, bg и fg

source: How to setup a public and private keypair for ssh access
ru: Как настроить открытую и закрытую пару ключей для доступа по ssh

source: How to transfer files between your local machine and remote machine using scp
ru: Как передавать файлы между локальным и удаленным компьютером с помощью scp

source: How to use SSH to connect to a remote machine
ru: Как использовать SSH для подключения к удаленному компьютеру

source: How to use VSCode with your VPS
ru: Как использовать VSCode с вашим VPS

source: However, centralized control is not always possible, for example, in large geographically distributed network systems.
ru: Однако, централизованное управление не всегда возможно, например, в крупных территориально-распределенных сетевых системах.

source: Hundreds of journal articles and dozens of books devoted to the analytical studies of DES abroad, specialized magazine «Discrete Event Dynamic Systems: Theory and Applications» is published by Springer.
ru: За границей изданы сотни статей и десятки книг, которые посвящены аналитическим исследованиям ДСС, издательство Springer выпускает специализированный журнал «Discrete Event Dynamic Systems: Theory and Applications».

source: I actually have several options here to stop the running Google Chrome process.
ru: На самом деле есть несколько вариантов остановить выполнябщийся процесс Google Chrome.

source: I almost always connect via an SSH key, so let’s first learn how to create that key on our local computer.
ru: Очень удобно подключаться при помощи SSH-ключа, поэтому сначала покажем, как создать этот ключ на локальном компьютере.

source: I am going to send the SIGSTOP process from a separate terminal window.
ru: Отправим процессу сигнал SIGSTOP из другого терминального окна.

source: I chose this particular website because I own it.
ru: Выбран именно этот сайт, потому что он принадлежит Заку (автору данного руководства).

source: I could do this quickly with sed.
ru: удобно исползовать sed.

source: I could easily find these 3 lines (each request has a date) using a regular expression.
ru: Делается это легко: надо найти три строки (в каждом из трех запросов есть дата) с помощью регулярного выражения.

source: I could list out a bunch of commands here for you, but they will not make any sense unless you understand the sequence that the bash shell (and kernel) takes when a new process is started.
ru: Можно перечислять все возможные команды, но в этом нет особого смысла, если не понимать последовательность функций, которые выполняет bash и ядро операционной системы при создании нового процесса.

source: I could send the SIGTSTP signal (i.e. CTRL-Z), or I could send the SIGSTOP process signal to the process.
ru: Можно послать сигнал SIGTSTP (т.е. CTRL-Z) или сигнал SIGSTOP процессу.

source: I find myself scrolling through large output all the time and forget that there is a command line utility that makes this a lot easier.
ru: Программа позволяет просматривать текстовые денные, интерактивно прокручивая строки на экране при помощи клавиатуры.

source: I had mentioned earlier that the server for my site is somewhere in New York, and the traceroute command will validate that by showing you the path we take to get there.
ru: Как было упомянуто ранее сервер сайта находится где-то в Нью-Йорке, и команда traceroute подтверждает это, показывая путь, по которому пакеты добираемся туда.

source: I have attempted to solve the problem two different ways using two different types of regexp syntax to demonstrate that there is more than one way to do things.
ru: Попробуем решить проблему двумя разными способами, используя два разных типа синтаксиса регулярных выражений, и продемонстрируем различные способы решать задачи.

source: I have created a file called awk-example.sh and placed the above command in it with better formatting.
ru: Создадим файл awk-example.sh и поместим туда вышеупомятую команду, отформатируем текст программы.

source: I have cut off most of the output of this command, but with the single example that I did provide, you can see that I have a Google Chrome window open (with process ID 26679) and one of my tabs is opened to stackoverflow.com.
ru: Большая часть вывода этой команды удалена, но здесь видно, что в системе открыто окно Google Chrome (с идентификатором процесса 26679), и одна из вкладок открыта на stackoverflow.com.

source: I have cut out parts of the strace ls output below and highlighted some of the most important parts.
ru: Результат работы strace ls, представленный ниже, обработан, так, чтобы обращать внимание читателяна наиболее важные части.

source: I have not yet explained what this syntax means, but essentially, we are searching for text that starts with “Book” and ends with 1 or more numbers.
ru: Не обращая внимания на то, что показанный синтаксис пока вам не понятен, выражение ищет слова, начинающиеся с «Book» и заканчивающиеся одним или более цифрами.

source: I just want to see the date, open, and volume.
ru: Например, выделим цены в колонках open и volume по датам (date).

source: I know the locations because I typed a few of them into this online tool.
ru: Показанные места известны, так как ранее они были найдены автором на этом онлайн-сервисе.

source: I know this because I looked it up on IANA.org.
ru: Это известно потому что это можно узнать на IANA.org.

source: I know this command looks overly complex and difficult to learn and the purpose of this tutorial is not to make you an awk expert, but let’s take a moment to walk through the basic syntax of an awk command.
ru: На первый взгляд команда выглядит слишком сложной для изучения, но проведем некоторый ее обзор.

source: I looked up on StackOverflow how to pipe the output of the find command
ru: Выражение подсмотрено на StackOverflow, оно передает (pipe) вывод команды find

source: I made two changes here.
ru: Здесь сделано два изменения.

source: I open my computer, open my browser (in this case, Google Chrome), and type “www.thediygolfer.com" into the search bar.
ru: Запускаем компьютер, открываем браузер (в данном случае Google Chrome) и набираем “www.thediygolfer.com" в строке адреса.

source: I press Enter.
ru: Нажимаем ВВОД.

source: I primarily use Digital Ocean for my hosting needs, so I will be going through a tutorial on how to setup and connect to a virtual private server on Digital Ocean.
ru: В дальнейших примерах в основном использован хостинг в компании Digital Ocean, настройка и подключение к виртуальному частному серверу в Digital Ocean также будет продемонстрировано.

source: I recently wrote a script in Microsoft Excel VBA that executed commands from an external library.
ru: Ранее был создан скрипт на Microsoft Excel VBA, запускающий функции из одной динамической библиотеки.

source: I saved if-then statements for last because they can get a bit complicated.
ru: Оператор оставлен if-then напоследок, потому что он немного сложноватый для понимания.

source: I suggest appending the --mega flag to display the amount of memory in megabytes rather than the default kibibytes.
ru: Добавление ключа --мега к команде позволяет отображать объем оперативной памяти в мегабайтах, а не как по умолчанию в кибибайтах.

source: I then told NameSilo where I want to point the domain name to.
ru: ??? Затем я сказал NameSilo, где хочу указать доменное имя.

source: I will elaborate on this as we move forward, but let’s start simple.
ru: Давайте начнем с простого.

source: I will go through some of the most useful and common.
ru: Приведем самые полезные.

source: I won’t explain every line here, but you can reasonably infer what each line means.
ru: Не будем разбираться в каждой строке, но можно сделать разумную оценку, что означает каждая строка.

source: I would perform the following search while adding the -E flag for “extended regular expressions”.
ru: надо исползовать флаг -E, включающий режим “расширенных регулярных выражений”.

source: I/O (input/output)
ru: Периферийные устроства ввода/вывода (input/output,IO)

source: IEEE Transactions on Cybernetics, 2019, Early Access Article) adopted the non-zero-sum game reinforcement learning method to optimize the optimal solution of each agent iteratively and each subsystem is coordinated and controlled.
ru: IEEE Transactions on Cybernetics, 2019, Early Access Article) адаптировал игры с ненулевой оценкой в методе обучения с подкреплением для получения оптимального решения для каждого агента интерактивно, при этом каждая из подсистем координируется и управляется.

source: ISDCT SB RAS team has great deal of experience in constructing complex programming systems by combining various software components and modules.
ru: Команда ИДСТУ СО РАН имеет большой опыт в построении сложных систем программирования путем объединения различных программных компонентов и модулей.

source: ISPs are confusing in many cases because they offer more than one service, but in the scope of this post, let’s consider an ISP that offers only internet as a service.
ru: Сервисы интернет-провайдеров во многих случаях сбивают с толку, потому что они предлагают несколько услуг, здесь будем считать, что интернет-провайдеры предлагает только доступ Интернет в качестве услуги.

source: If Google Chrome got 100% of the computer’s resources 100% of the time, the computer would become dysfunctional because there are many processes that are running at the kernel level to keep everything in order.
ru: Если Google Chrome завхватит 100% ресурсов во все 100% времени, компьютер, вероятно, выкинит Google из пямяти компьютера потому, что в ядре есть разные фцнкции поддеривающих функционирование операционной системы.

source: If I add the -i flag to the command, it will edit the file.
ru: Если добавить флаг -i, то sed будет редактировать исходный файл (in-place).

source: If I had sample-file.txt, the way I would upload this to my remote machine is like so:
ru: Например, загрузим sample-file.txt на удаленную машину:

source: If I typed ifconfig into another computer on my network, the broadcast address and subnet mask will not change, but the IP address will.
ru: Если я наберу ifconfig на другом компьютере в своей сети, широковещательный адрес и маска подсети не изменятся, но IP-адрес изменится.

source: If I wanted to match the word “random” in this text, I could do this with a regular text searching tool.
ru: Если надо просто найти слово «random» в этом тексте, то просто используйте редактор или команду поиска текста.

source: If a distributed control deals with coupling relationship through communication between subsystems well, then the control performance is greatly improved.
ru: Качество управления распределенной системой в целом напрямую зависит от того как решается задача обеспечения взаимодействия подсистем.

source: If a group file is given, it will also provide the group count breakdown.
ru: Если задан ```group```-файл, то будет произведен подсчет по каждой группе.

source: If a set of inferences are obtained, they are analyzed and the better is chosen.
ru: Если получено множество подходящих выводов, то производится их анализ, выбирается лучший.

source: If it doesn’t find it there, it will look in /usr/bin, and finally, /bin.
ru: Если он не найдет его там, он перейдет в /usr/bin, и, наконец, в /bin.

source: If it is, it returns true (0 exit code).
ru: Если это так, возвращается истина (код выхода 0).

source: If take Galaxy as the main data processing visualization technique, we are to make Galaxy modules adapting Mothur command, as well as adapt Galaxy visualization techniques to the MiSeq SOP.
ru: Если взять Galaxy в качестве основного метода визуализации обработки данных, то надо сделать модули Galaxy, адаптирующие команду Mothur, а также адаптировать методы визуализации Galaxy к MiSeq SOP.

source: If the field has a * by it, this means that it is currently showing.
ru: Если против поля виднеется *, то это значит, что данное поле сейчас отображается.

source: If the inference corresponds a set of criteria, it is considered as successful.
ru: Если вывод соответствует набор критериев, он считается успешным.

source: If the keys validate, the user now gets remote access to the VPS, and your IP address is stored as a “known host” on the VPS.
ru: Если ключи подтверждены, пользователь получает удаленный доступ к VPS, а ваш IP-адрес сохраняется как «известный хост» на VPS.

source: If the theorem holds, then the program is correct, it means that all the requirements for it are met and its algorithm stops.
ru: Если теорема верна, то и программа тоже верна, что означает, что все требования к ней выполняются, а ее алгоритм останавливается.

source: If there are unbalanced load on cores the balance is periodically reconstructed by moving a tree of scenarios to less load nodes.
ru: Если обнаруженя неравномерная загрузка ядер то производится балансировка при помощи перемещения дерева сценариев на узел с меньшей нагрузкой.

source: If there is a match, advance to the next letter in the search string and check to see if that matches the next character in the file
ru: Если есть совпадение, перейти к следующей букве в строке поиска и проверить, соответствует ли она следующему символу в файле.

source: If we activate the Perl regular expressions feature of grep, we can find this same word.
ru: При помощи функции регулярных выражений Perl, grep также находит это слово.

source: If we omit these two characters, we will match the word “Date” 3 times, but we won’t get the actual date information that we really want.
ru: Если из выражения убрать две последние составляющие, то «Date» будет найдено три раза, но требуемой информации по дате не будет получено.

source: If we reach the end of our search string without any errors, then we have matched the text
ru: Если алгоритм дошел до конца строки поиска без несоответствий, значит, строка и тест сопоставимы.

source: If we tried to match this line using just the skills we know now, we might try something like so:
ru: ???Если бы мы попытались соответствовать этой линии, используя только навыки, которые мы знаем сейчас, мы могли бы попробовать что-то вроде этого:

source: If we want to place a test in a script for an if-then statement, we can write it like so:
ru: Использование test в сценарии в операторе if-then выглядит следующим образом:

source: If we wanted to copy all the matches to a ~/pictures-backup folder, you can add the exec command.
ru: Если есть необходимость скопировать все совпадения в папку ~/pictures-backup, добавляем команду exec.

source: If we wanted to display only process ID 22435, we could put a filter on the top output.
ru: Если надо показать только процесс по ID 22435, надо задать фильтр.

source: If we wanted to only show the user zach processes, we type the letter n followed by “zach”.
ru: Если надо показать только процессы пользователя zach, нажимаем клавмшу n, вводим "zach".

source: If we were to write a text matching program, it would roughly follow these steps:
ru: Если бы мы написали программу сопоставления текста, она состояла б из следующих шагов:

source: If you are completely new to network concepts, that is completely fine as I will be explaining the basics of the internet in the next section.
ru: Если вы совершенно не знакомы с концепциями сетей, то некоторый базовый уровень знаний можно поличить читая этот раздел.

source: If you are displaying all your processes and your free memory is low, this could be a red flag that you are running out of RAM.
ru: В режиме отображения всех процессов при недостатке свободная памяти может отображаться красный флаг, сигнализирующий, что память заканчивается.

source: If you are truly curious about each of the system calls in the strace command output, here is a great StackOverflow post.
ru: Если вам действительно интересно узнать о каждом из системных вызовов в выводе команды strace, вот отличный пост на StackOverflow.

source: If you capitalize \D, \S, and \W, it negates the expression.
ru: Если вышепреведенный символ перевести в верхний регистр (\D, \S, \W) создает противоположный эффект.

source: If you choose not to read it, here are the cliffnotes (and a diagram):
ru: Если вы решите не тратить время на читение, вот некоторые заметки и диаграмма:

source: If you have ever programmed in the C programming language, you might find a few of these commands familiar.
ru: Программисты на языке C, вероятно, знакомы с некоторыми из этих команд.

source: If you need to modify the path, you can update it in your ~/.profile like so:
ru: Если вам нужно изменить путь, вы можете обновить его в своем ~/.profile:

source: If you run these two commands, you will get output of 0 and 1.
ru: Запустив эти две команды, получи результат 0 и 1.
